InformationRegisters/РазмерОбъектовМетаданныхПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РазмерОбъектовМетаданныхПриложений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РазмерПриложенийСлужебный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
// 
// Параметры:
// 	Типы - См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.Типы
// 
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьРазмерПриложений);
	Типы.Добавить(Метаданные.РегистрыСведений.РазмерОбъектовМетаданныхПриложений);
	
КонецПроцедуры

// Проверяет, поддерживается ли расчет размера приложений.
//
Процедура ПроверитьПоддержкуРасчетаРазмераПриложений() Экспорт
	
	Если Не ПоддерживаетсяРасчетРазмераПриложений() Тогда
		ВызватьИсключение(НСтр("ru = 'Функциональность расчета размера приложений не поддерживается'"));
	КонецЕсли;
	
КонецПроцедуры

// Поддерживается расчет размера приложений.
// 
// Возвращаемое значение:
//  Булево
Функция ПоддерживаетсяРасчетРазмераПриложений() Экспорт
	
	Инфо = Новый СистемнаяИнформация;
	МинимальнаяВерсия = МинимальноНеобходимаяВерсияПлатформы();
	 
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(
		Инфо.ВерсияПриложения, МинимальнаяВерсия) < 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Выполняет расчет размера приложения.
//
Процедура РассчитатьРазмерПриложения() Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь(, Истина) Тогда
		ВызватьИсключение(НСтр("ru = 'Недостаточно прав для выполнения операции'"));
	КонецЕсли;
	
	ПроверитьПоддержкуРасчетаРазмераПриложений();
	
	МодельДанных = РаботаВМоделиСервиса.ПолучитьМодельДанныхОбласти();
	РазмерМетаданных = РазмерМетаданныхПриложения();
	ПараметрыРасчета = ПолучитьНастройкиРасчетаРазмераПриложений();
	
	РазмерПриложения = 0;
	МинимальныйШагИзменений = ЗначениеНастройкиРасчета("МинимальныйШагИзменений", 0, ПараметрыРасчета);
	
	Параметры = Новый Структура();
	Параметры.Вставить("СписокОбъектов", Новый Массив(1));
	
	Для Каждого ЭлементМодели Из МодельДанных Цикл
		
		ОбъектМетаданных = ЭлементМодели.Ключ;
		Параметры.СписокОбъектов[0] = ОбъектМетаданных;
		
		Размер = ОбщегоНазначения.ВычислитьВБезопасномРежиме(
			"ПолучитьРазмерДанныхБазыДанных(, Параметры.СписокОбъектов)",
			Параметры);
		ЗаписанныйРазмер = ЗаписатьРазмерМетаданныхПриложения(
			РазмерМетаданных, ОбъектМетаданных, Размер, МинимальныйШагИзменений);
		
		РазмерМетаданных.Удалить(ОбъектМетаданных);
		РазмерПриложения = РазмерПриложения + ЗаписанныйРазмер; 
		
	КонецЦикла;
	
	Для Каждого ЭлементМетаданные Из РазмерМетаданных Цикл
		ЗаписатьРазмерМетаданныхПриложения(РазмерМетаданных, ЭлементМетаданные.Ключ);
	КонецЦикла;
	
	ЗаписатьРазмерПриложения(РазмерПриложения);
	
КонецПроцедуры

// Получает значение настройки расчета размера приложений.
//
// Параметры:
//  ИмяНастройки - Строка - имя настройки
//  ЗначениеПоУмолчанию - Строка, Число, Дата - значение возвращаемое, если настройка не найдена 
//  Настройки - ФиксированнаяСтруктура - настройки расчета размера приложений
//
// Возвращаемое значение:
//  Строка, Число, Дата - значение настройки
//
Функция ЗначениеНастройкиРасчета(ИмяНастройки, ЗначениеПоУмолчанию = Неопределено, Настройки = Неопределено) Экспорт
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

// Возвращает часть полного имени объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - Строка - полное имя объекта метаданных
//  НомерЧасти - Число - номер части имени объекта метаданных (0 - вид метаданных, 1 - имя)
//
// Возвращаемое значение:
//  Строка - Часть полного имени объекта метаданных
//
Функция ЧастьПолногоИмениОбъектаМетаданных(ОбъектМетаданных, НомерЧасти) Экспорт
	
	ЧастиПолногоИмени = СтрРазделить(ОбъектМетаданных, ".", Ложь);
	Если ЧастиПолногоИмени.Количество() < НомерЧасти Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ЧастиПолногоИмени[НомерЧасти - 1];
	
КонецФункции

// Возвращает текущую дату расчета размера приложения
// 
// Возвращаемое значение:
//  Дата - Текущая дата расчета размера приложения
//
Функция АктуальностьРасчетаРазмераПриложения() Экспорт
	
	Возврат Дата(1, 1, 1);
	
КонецФункции

Функция РазмерПриложенияБольшеДопустимого() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Добавляет задание по расчету размера приложения.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ОбластьДанных - Число - номер области данных
//
Процедура ЗапланироватьРасчетРазмераПриложения(ОбластьДанных = Неопределено) Экспорт

КонецПроцедуры

// Проверяет наличие задания по расчету размера приложения
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ОбластьДанных - Число - номер области данных
//
// Возвращаемое значение:
//  Булево - Истина, если есть запланированные задания расчета размера приложения
//
Функция ЕстьЗапланированноеЗаданиеРасчетаРазмераПриложения(ОбластьДанных = Неопределено) Экспорт

КонецФункции

// Проверяет наличие задания по расчету размера приложения
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  Размер - Число - 
//  ТекстОшибки - Строка - 
//
Процедура ЗаписатьРазмерПриложения(Размер, ТекстОшибки = Неопределено) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьРазмерМетаданныхПриложения(РазмерМетаданных,
										   ОбъектМетаданных,
										   Размер = Неопределено,
										   МинимальныйШагИзменений = Неопределено)
	
	ВыполнятьЗапись = Ложь;
	ЗаписанныйРазмер = 0;
	ПредыдущийРазмер = РазмерМетаданных.Получить(ОбъектМетаданных);
	
	Если ПредыдущийРазмер = Неопределено Тогда
		ВыполнятьЗапись = Размер <> Неопределено И Размер > 0;
	ИначеЕсли Размер = Неопределено Тогда
		 Размер = 0;
		 ВыполнятьЗапись = Истина;
	Иначе
		
		РазницаВРазмере = Размер - ПредыдущийРазмер;
		Если РазницаВРазмере < 0 Тогда
			РазницаВРазмере = -1 * РазницаВРазмере;
		КонецЕсли;
		
		Если МинимальныйШагИзменений = Неопределено Тогда
			МинимальныйШагИзменений = 0;
		КонецЕсли;
		
		Если РазницаВРазмере > 0 И РазницаВРазмере >= МинимальныйШагИзменений Тогда
			ВыполнятьЗапись = Истина;
		КонецЕсли;
		
		ЗаписанныйРазмер = ПредыдущийРазмер;
		
	КонецЕсли;
	
	Если ВыполнятьЗапись Тогда
		
		Запись = РегистрыСведений.РазмерОбъектовМетаданныхПриложений.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.ОбъектМетаданных = ОбъектМетаданных;
		Запись.Размер = Размер;
		Запись.Записать();
		
		ЗаписанныйРазмер = Размер;
		
	КонецЕсли;
	
	Возврат ЗаписанныйРазмер;
	
КонецФункции

Функция РазмерМетаданныхПриложения()
	
	РазмерМетаданных = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмерОбъектовМетаданных.ОбъектМетаданных,
	|	РазмерОбъектовМетаданных.Размер
	|ИЗ
	|	РегистрСведений.РазмерОбъектовМетаданныхПриложений.СрезПоследних КАК РазмерОбъектовМетаданных";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат РазмерМетаданных;
	КонецЕсли;
	
	ВыборкаРезультат = Результат.Выбрать();
	Пока ВыборкаРезультат.Следующий() Цикл
		РазмерМетаданных.Вставить(ВыборкаРезультат.ОбъектМетаданных, ВыборкаРезультат.Размер);
	КонецЦикла;
	
	Возврат РазмерМетаданных;
	
КонецФункции

Функция МинимальноНеобходимаяВерсияПлатформы()
	
	Возврат "8.3.15.1000";
	
КонецФункции

// Получает настройки расчета размера приложений.
//
Функция ПолучитьНастройкиРасчетаРазмераПриложений()
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
